data/pipeFlowFine/baseCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       19750;
    }
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       20150;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       20200;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10000;
        startFace       20250;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10000;
        startFace       30250;
    }
)

// ************************************************************************* //
